#include<stdio.h>

int main()
{
    int sum=0,i,j,k;
    char a[17],t;
    scanf("%s",&a);
    int b[17]={7,9,10,5,8,4,2,1,6,3,7,9,10,5,8,4,2};
    for(i=0;i<17;i++)
        sum=(a[i]-48)*b[i]+sum;
    k=sum%11;
    int f[11]={0,1,2,3,4,5,6,7,8,9,10};
    char g[11]={'1','0','X','9','8','7','6','5','4','3','2'};//注意是大写的'X'
    for(j=0;j<=10;j++)
        if(f[j]==k)
        break;
    t=g[j];
    printf("%c",t);
    return 0;
}
/*后边的判断过程也可以写为
char[2][11]={{0,1,2,3,4,5,6,7,8,9,10},{'1','0','X','9','8','7','6','5','4','3','2'}};
for(j=0;j<11;j++)
    if(f[0][j]-48==k)
    break;
t=f[1][j];
printf("%c",t);
return 0;
*/
