# include <stdio.h>
/*题目描述 Description
地球上的科学家收到了来自外星的信号：000023*000011=002093，科学家猜想这是某个外星人的年龄。但有人指出，这些外星人好像不怎么聪明，
因为23*11=253，而非2093。但是科学家们发现，如果把000011改成00091的话算式就成立了。他们认为这是接收信号的时候出了差错的缘故。现在
给你这样一个算式，问最少改动几个数字就能使得算式成立？
我们忽略进位，即a*b的结果只要最后6位与c相同就认为算式成立。
*/
int main()           //数据有问题
{
    return 0;
}

/*
输入描述 Input Description
输入文件life.in只有一个算式以a*b=c的形式给出，其中a、b、c长度都是6位。
输出描述 Output Description
在life.out中输出最少改动几个数字才能使得算式成立。
样例输入 Sample Input
000023*000011=002093
样例输出 Sample Output
1
数据范围及提示 Data Size & Hint
*/
	