# include <stdio.h>
/*
题目描述 Description
有一个矩形房间，覆盖正方形瓷砖。每块瓷砖涂成了红色或黑色。一名男子站在黑色的瓷砖上，由此出发，可以移到四个相邻瓷砖之一，但他不能移动
到红砖上，只能移动到黑砖上。编写一个程序，计算他通过重复上述移动所能经过的黑砖数。
*/
char s[20][20];
int t;

void fun(int h, int w, int p, int q)
{
	if(s[p][q] == '.')         //注意要全放在if里面
	{
		t ++;
		s[p][q] = '#';
		if(p-1 >= 0)
			fun(h, w, p-1, q);
		if(p+1 <= h-1)
			fun(h, w, p+1, q);
		if(q-1 >= 0)
			fun(h, w, p, q-1);
		if(q+1 <= w-1)
			fun(h, w, p, q+1);
	}
}

int main(void)
{
	int w, h, i, j, p, q;
	while(1)
	{
		t = 0;
		scanf("%d %d", &w, &h);
		if(h == 0)
			break;
		getchar();
		for(i = 0; i < h; i++)
		{
			for(j = 0; j < w; j++)
			{
				scanf("%c", &s[i][j]);
				if(s[i][j] == '@')
				{
					p = i, q = j;    //p, q 标记起始位置
					s[i][j] = '.';
				}
			}
			getchar();
		}
		fun(h, w, p, q);
		printf("%d\n", t);
	}

	return 0;
}

/*
输入描述 Input Description
输入包含多个数据集。一个数据集开头行包含两个正整数W和H，W和H分别表示矩形房间的列数和行数，且都不超过20.
每个数据集有H行，其中每行包含W个字符。每个字符的含义如下所示：
'.'——黑砖
'#'——红砖
'@'——男子（每个数据集仅出现一次）
两个0表示输入结束。
输出描述 Output Description
对每个数据集，程序应该输出一行，包含男子从初始瓷砖出发可到达的瓷砖数。
样例输入 Sample Input
6 9
....#.
.....#
......
......
......
......
......
#@...#
.#..#.
11 9
.#.........
.#.#######.
.#.#.....#.
.#.#.###.#.
.#.#..@#.#.
.#.#####.#.
.#.......#.
.#########.
...........
11 6
..#..#..#..
..#..#..#..
..#..#..###
..#..#..#@.
..#..#..#..
..#..#..#..
7 7
..#.#..
..#.#..
###.###
...@...
###.###
..#.#..
..#.#..
0 0
样例输出 Sample Output
45
59
6
13
数据范围及提示 Data Size & Hint
无
*/
